docs/arbel_revised.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-11 Tue 14:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ARBEL</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zach Flynn" />
<meta name="description" content="ARBEL is a registry-based environment and language."
 />


</head>
<body>
<div id="preamble" class="status">
ARBEL<br>Zach Flynn<br>2020-08-11 Tue 14:10
</div>
<div id="content">
<h1 class="title">ARBEL</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org362b085">1. Code inside Data</a></li>
<li><a href="#org5eedca5">2. Syntax</a>
<ul>
<li><a href="#orgbb7cf07">2.1. Literals and Names</a>
<ul>
<li><a href="#orga6fde34">2.1.1. Numeric Literals</a></li>
<li><a href="#orge747fac">2.1.2. String Literals</a></li>
<li><a href="#org051da86">2.1.3. Boolean Literals</a></li>
<li><a href="#org25191e4">2.1.4. Register Literals</a></li>
<li><a href="#org2caf4ae">2.1.5. Instruction Literals</a></li>
<li><a href="#orgd86e8f1">2.1.6. Operator Literals</a></li>
<li><a href="#orge36a7c6">2.1.7. The Nothing Literal</a></li>
</ul>
</li>
<li><a href="#orga0393d0">2.2. Substatements</a>
<ul>
<li><a href="#orgdb16aa5">2.2.1. Immediate Substatements</a></li>
<li><a href="#org19d0aba">2.2.2. Active Instructions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org37799ab">3. Registries</a></li>
<li><a href="#orgc8fadfe">4. Instructions</a>
<ul>
<li><a href="#org1f46f5b">4.1. Defining operations</a></li>
</ul>
</li>
<li><a href="#org9234f8a">5. Examples</a>
<ul>
<li><a href="#orgcf101da">5.1. Short Examples</a></li>
<li><a href="#org095de93">5.2. Complete Program</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org362b085" class="outline-2">
<h2 id="org362b085"><span class="section-number-2">1</span> Code inside Data</h2>
<div class="outline-text-2" id="text-1">
<p>
ARBEL code is executed inside a data set called a registry.  Registries are tables with values entered in <i>registers</i>. The programmer enters commands to modify the contents of the registry and possibly send the results of any computations performed on the data to another registry.
</p>

<p>
Code in ARBEL has no context or scope of its own.  It requires a registry to give it context.  For example,
</p>
<div class="org-src-container">
<pre class="src src-arbel">... print x .
</pre>
</div>

<p>
requires that the registry contains data located at the <code>print</code> and <code>x</code> register.  Different registries could contain different values at these locations so the same code might perform different actions in different contexts.  
</p>
</div>
</div>

<div id="outline-container-org5eedca5" class="outline-2">
<h2 id="org5eedca5"><span class="section-number-2">2</span> Syntax</h2>
<div class="outline-text-2" id="text-2">
<p>
ARBEL code consists of a number of statements.  Each statement contains a series of data values, either literals or values located in the current registry, separated by whitespace and ending with a period.  All elements of a statement must be separated by whitespace from the preceding element, including the terminating period.
</p>
<div class="org-src-container">
<pre class="src src-arbel">... data1 data2 data3 data4 .
</pre>
</div>

<p>
The following are examples of statements:
</p>
<div class="org-src-container">
<pre class="src src-arbel">... add 1 2 .
ans = 3
... print <span style="color: #4E9A06;">"Hello"</span> .
Hello
</pre>
</div>

<p>
The first element of a statement is an operation that performs some transformation of the other data elements in the statement and the contents of the registry in which the statement is executed.  The first statement uses the operation located at the <code>add</code> register.  The second uses the operation located at the <code>add</code> register.  The numbers and the the string <code>"Hello"</code> are literals.
</p>
</div>

<div id="outline-container-orgbb7cf07" class="outline-3">
<h3 id="orgbb7cf07"><span class="section-number-3">2.1</span> Literals and Names</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Names are sequences of characters that are not literals and not parenthesis (<code>()</code>, <code>[]</code>, <code>{}</code>, <code>&lt;&gt;</code>).  A name appearing in a statement indicates the value located at the register with that name.
</p>

<p>
Literals represent a value of data.
</p>
</div>

<div id="outline-container-orga6fde34" class="outline-4">
<h4 id="orga6fde34"><span class="section-number-4">2.1.1</span> Numeric Literals</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Numbers are a sequence of digits either with or without a decimal point.  With a decimal point, the type of the literal is a Real.  Without a decimal point, the type of the literal is an Integer. Example: <code>123</code> and <code>1.23</code>.
</p>
</div>
</div>

<div id="outline-container-orge747fac" class="outline-4">
<h4 id="orge747fac"><span class="section-number-4">2.1.2</span> String Literals</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Strings are a sequence of characters enclosed by double quotes (<code>""</code>). Example: <code>"Hello, world."</code>.  
</p>
</div>
</div>

<div id="outline-container-org051da86" class="outline-4">
<h4 id="org051da86"><span class="section-number-4">2.1.3</span> Boolean Literals</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Boolean literals are one of two words: <code>True</code> and <code>False</code> (case sensitive).  
</p>
</div>
</div>

<div id="outline-container-org25191e4" class="outline-4">
<h4 id="org25191e4"><span class="section-number-4">2.1.4</span> Register Literals</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
A register location is a name preceeded by a forward slash <code>/</code>.  Example: <code>/hello</code>, <code>/x1</code>.  These literals refer to the register location, not its value.  Almost any string of characters is a valid register location, but some will be less convenient to access because they collide with other elements of ARBEL's syntax.  But they can still be used.  For example,
</p>
<div class="org-src-container">
<pre class="src src-arbel">... set <span style="color: #0084C8; font-weight: bold;">/.</span> 1 .
... get <span style="color: #0084C8; font-weight: bold;">/.</span> .
ans = 1
</pre>
</div>

<p>
Can be used to access the value when the register's value cannot be accessed in the usual way, by omitting the forward slash.
</p>
</div>
</div>

<div id="outline-container-org2caf4ae" class="outline-4">
<h4 id="org2caf4ae"><span class="section-number-4">2.1.5</span> Instruction Literals</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
Instructions are ARBEL statements enclosed in open parenthesis.  Instructions are code that is not executed but saved as data to be used in another environment.  Example: <code>( add t 2 . mul ans 5 . )</code> which is an instruction to add <code>2</code> to the value at a register <code>/t</code> and multiply the answer by <code>5</code>. This code is not executed and resolves to a type of data called an Instruction.  It is treated as a literal value.  The whitespace following the first parenthesis and preceeding the last is required.
</p>
</div>
</div>

<div id="outline-container-orgd86e8f1" class="outline-4">
<h4 id="orgd86e8f1"><span class="section-number-4">2.1.6</span> Operator Literals</h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
Operations are like instructions except that they are less flexible because they must be called in a certain way with fixed positional arguments.  Operation literals are enclosed in angle brackets (<code>&lt;&gt;</code>) like so: <code>&lt; ( add t 1 . ) /t &gt;</code>.  The first element inside the angle brackets is an instruction.  The rest of the arguments are registers which give the data locations to bind the operator's arguments to when called so that: <code>&lt; ( add t 1 . ) /t &gt; 10 .</code> would give <code>11</code>.  These values are treated as literals of the Operation type.
</p>
</div>
</div>

<div id="outline-container-orge36a7c6" class="outline-4">
<h4 id="orge36a7c6"><span class="section-number-4">2.1.7</span> The Nothing Literal</h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
The word <code>Nothing</code> is a literal value of type <code>Nothing</code>.  <code>Nothing</code> is not like other data types.  That is the most important thing about it.  It can be used as the return value for errors and other situations.
</p>
</div>
</div>
</div>

<div id="outline-container-orga0393d0" class="outline-3">
<h3 id="orga0393d0"><span class="section-number-3">2.2</span> Substatements</h3>
<div class="outline-text-3" id="text-2-2">
<p>
ARBEL statements can contain two forms of substatements in place of a data element.  The substatements differ by when the code they contain is executed.  
</p>
</div>

<div id="outline-container-orgdb16aa5" class="outline-4">
<h4 id="orgdb16aa5"><span class="section-number-4">2.2.1</span> Immediate Substatements</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Immediate substatements are executed as soon as they are encountered.  They evaluate to the value of the <code>ans</code> register in the registry where the code is executed after the substatement is executed. They are enclosed in square brackets.
</p>

<div class="org-src-container">
<pre class="src src-arbel">... add [ sub 5 3 . ] 10 .
ans = 12
</pre>
</div>

<p>
<code>sub</code> is the usual location of the subtraction operator.  The bracketed substatement is evaluated and replaced with the value of the <code>ans</code> register after <code>sub 5 3 .</code> is executed.   The subtraction and other arithmetic operations set the <code>ans</code> register to their result.  So <code>2</code> is the first data element in the outer statement.  <code>add</code> then adds <code>2</code> and <code>10</code> setting the <code>ans</code> register to <code>12</code>.
</p>
</div>
</div>

<div id="outline-container-org19d0aba" class="outline-4">
<h4 id="org19d0aba"><span class="section-number-4">2.2.2</span> Active Instructions</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Active instructions are executed <i>when they are used</i>.  They are usually used in conditional operations so that code is not executed unless it is required.  They are enclosed in curly braces.
</p>
<div class="org-src-container">
<pre class="src src-arbel">... if <span style="color: #F5666D;">True</span> { print <span style="color: #4E9A06;">"hello"</span> . } { print <span style="color: #4E9A06;">"goodbye"</span> . } .
hello
... if <span style="color: #F5666D;">False</span> { print <span style="color: #4E9A06;">"hello"</span> . } { print <span style="color: #4E9A06;">"goodbye"</span> . } .
goodbye
... if <span style="color: #F5666D;">True</span> [ print <span style="color: #4E9A06;">"hello"</span> . ] [ print <span style="color: #4E9A06;">"goodbye"</span> . ]
hello
goodbye
</pre>
</div>

<p>
This code block illustrates the difference between active instructions and immediate substatements.  The <code>if</code> operation accesses and returns its second argument if the first argument is <code>True</code> and the third argument if the first is <code>False</code>.  So, only the first active instruction is executed in the first line of code and only the second active instruction is executed in the second line.  The third line uses immediate substatements instead.  These are executed as soon as they are encountered regardless of whether the <code>if</code> operation accesses their value.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org37799ab" class="outline-2">
<h2 id="org37799ab"><span class="section-number-2">3</span> Registries</h2>
<div class="outline-text-2" id="text-3">
<p>
Registries are tables of data located at registers.  Register locations are prefixed with a forward slash in ARBEL so:
</p>
<div class="org-src-container">
<pre class="src src-arbel"><span style="color: #0084C8; font-weight: bold;">/hello</span>
<span style="color: #0084C8; font-weight: bold;">/x</span>
<span style="color: #0084C8; font-weight: bold;">/z123</span>
</pre>
</div>

<p>
are all examples of register locations in ARBEL.  The value located at a registry is referenced by removing the forward slash.
</p>
<div class="org-src-container">
<pre class="src src-arbel">... set <span style="color: #0084C8; font-weight: bold;">/x</span> 10 .
... print x .
10
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc8fadfe" class="outline-2">
<h2 id="orgc8fadfe"><span class="section-number-2">4</span> Instructions</h2>
<div class="outline-text-2" id="text-4">
<p>
Instructions are code literals.  In syntax, they are statements enclosed in open parenthesis. Instructions can be executed with either the <code>in</code> or the <code>call</code> operations and they are often used as arguments for various operations like loops.  
</p>

<p>
The <code>in</code> operation executes the instruction inside an existing registry.
</p>

<div class="org-src-container">
<pre class="src src-arbel">... set <span style="color: #0084C8; font-weight: bold;">/assign-x</span> ( set <span style="color: #0084C8; font-weight: bold;">/x</span> 10 . ) .
... set <span style="color: #0084C8; font-weight: bold;">/y</span> [ registry . ] .
... in y assign-x .
... print x .
Error: Value at register <span style="color: #0084C8; font-weight: bold;">/x</span> not found.
... in _ assign-x .
... print x .
10
</pre>
</div>

<p>
This example demonstrates both using instructions and how ARBEL code executes inside registries.  The <code>registry</code> operation creates a new registry.  The statement <code>in y assign-x</code> executes the code in the instruction located at <code>/assign-x</code> in the context of the <code>y</code> register.  So, within the <code>y</code> registry, the value located at <code>/x</code> is <code>10</code>.  But, because we are currently not inside the <code>/y</code> registry, after the <code>in</code> command we cannot access those registries so <code>print x</code> prints nothing.  The special name <code>_</code> refers to the current registry.  So <code>in _ assign-x</code> runs the instruction <code>assign-x</code> in the current registry.  So <code>/x</code> in the current registry now holds the value <code>10</code>.
</p>

<p>
The <code>call</code> operation executes the instruction inside a temporary registry defined by the user calling the code.  It then sets the <code>/ans</code> register in the calling registry to the value of the <code>/ans</code> register in the temporary registry.
</p>
<div class="org-src-container">
<pre class="src src-arbel">... set <span style="color: #0084C8; font-weight: bold;">/add-one</span> ( add t 1 . ) .
... call add-one <span style="color: #0084C8; font-weight: bold;">/t</span> 10 .
ans = 11
</pre>
</div>

<p>
The <code>call</code> operations takes an instruction and then alternating register value pairs as arguments.  The register value pairs define the state of the temporary registry when the code is run.  Because the caller of the code defines the state of the registry, any non-literal can be modified by the caller.
</p>
<div class="org-src-container">
<pre class="src src-arbel">... set <span style="color: #0084C8; font-weight: bold;">/add-one</span> ( add t 1 . ) .
... call add-one <span style="color: #0084C8; font-weight: bold;">/t</span> 10 .
ans = 11
... call add-one <span style="color: #0084C8; font-weight: bold;">/t</span> 10 <span style="color: #0084C8; font-weight: bold;">/add</span> sub .
ans = 9
</pre>
</div>

<p>
The second line typically located at the register <code>/add</code> (the <code>add</code> operation) with the operation located at the register <code>/sub</code> (the <code>sub</code> operation).  But it only makes this replacement in the temporary registry.  The registry calling the code is unaffected by this change.  So <code>call add-one /t 10 /add sub</code> subtracts <code>1</code> from <code>10</code> instead of adds.
</p>

<p>
The main difference between the <code>in</code> and <code>call</code> operation is that the <code>call</code> operation moves the value of <code>/ans</code> in the temporary registry it creates back to the calling registry.  The <code>in</code> operation is typically used for modifying registries and the <code>call</code> operation is typically used for computations.
</p>

<p>
As a convenience, if an instruction is the first data object in a statement, ARBEL assumes that you want to <code>call</code> it.  It operates exactly the same as if you had included the <code>call</code> operation itself.
</p>
<div class="org-src-container">
<pre class="src src-arbel">... set <span style="color: #0084C8; font-weight: bold;">/add-one</span> ( add t 1 . ) .
... add-one <span style="color: #0084C8; font-weight: bold;">/t</span> 10
ans = 10
</pre>
</div>
</div>

<div id="outline-container-org1f46f5b" class="outline-3">
<h3 id="org1f46f5b"><span class="section-number-3">4.1</span> Defining operations</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Most new procedures that a programmer writes in ARBEL are instructions, but it is sometimes useful to have "positional" arguments like operations.  Users write operations by writing instructions and assigning argument numbers to different registers in the temporary registry. They can be defined using angle brackets or the <code>op</code> operation.
</p>

<div class="org-src-container">
<pre class="src src-arbel">... set <span style="color: #0084C8; font-weight: bold;">/add-one</span> [ op ( add t 1 . ) <span style="color: #0084C8; font-weight: bold;">/t</span> . ] .
... add-one 5 .
ans = 6
... set <span style="color: #0084C8; font-weight: bold;">/add-one</span> <span style="color: #00578E; font-weight: bold;">&lt;</span> ( add t 1 . ) <span style="color: #0084C8; font-weight: bold;">/t</span> <span style="color: #00578E; font-weight: bold;">&gt;</span> .
... add-one 5 .
ans = 6
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-org9234f8a" class="outline-2">
<h2 id="org9234f8a"><span class="section-number-2">5</span> Examples</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgcf101da" class="outline-3">
<h3 id="orgcf101da"><span class="section-number-3">5.1</span> Short Examples</h3>
</div>

<div id="outline-container-org095de93" class="outline-3">
<h3 id="org095de93"><span class="section-number-3">5.2</span> Complete Program</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zach Flynn</p>
<p class="date">Created: 2020-08-11 Tue 14:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
